from enum import Enum


class IncomeClassification(str, Enum):
    E3_106 = "E3_106"
    E3_205 = "E3_205"
    E3_210 = "E3_210"
    E3_305 = "E3_305"
    E3_310 = "E3_310"
    E3_318 = "E3_318"
    E3_561_001 = "E3_561_001"
    E3_561_002 = "E3_561_002"
    E3_561_003 = "E3_561_003"
    E3_561_004 = "E3_561_004"
    E3_561_005 = "E3_561_005"
    E3_561_006 = "E3_561_006"
    E3_561_007 = "E3_561_007"
    E3_562 = "E3_562"
    E3_563 = "E3_563"
    E3_564 = "E3_564"
    E3_565 = "E3_565"
    E3_566 = "E3_566"
    E3_567 = "E3_567"
    E3_568 = "E3_568"
    E3_570 = "E3_570"
    E3_595 = "E3_595"
    E3_596 = "E3_596"
    E3_597 = "E3_597"
    E3_880_001 = "E3_880_001"
    E3_880_002 = "E3_880_002"
    E3_880_003 = "E3_880_003"
    E3_880_004 = "E3_880_004"
    E3_881_001 = "E3_881_001"
    E3_881_002 = "E3_881_002"
    E3_881_003 = "E3_881_003"
    E3_881_004 = "E3_881_004"
    E3_598_001 = "E3_598_001"
    E3_598_003 = "E3_598_003"

    def __str__(self) -> str:
        labels = {
            IncomeClassification.E3_106: "Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Εμπορεύματα",
            IncomeClassification.E3_205: "Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Πρώτες ύλες και λοιπά υλικά",
            IncomeClassification.E3_210: "Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Προϊόντα και παραγωγή σε εξέλιξη",
            IncomeClassification.E3_305: "Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις – Καταστροφές αποθεμάτων/Πρώτες ύλες και λοιπά υλικά",
            IncomeClassification.E3_310: "Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Προϊόντα και παραγωγή σε εξέλιξη",
            IncomeClassification.E3_318: "Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Έξοδα παραγωγής",
            IncomeClassification.E3_561_001: "Πωλήσεις αγαθών και υπηρεσιών Χονδρικές - Επιτηδευματιών",
            IncomeClassification.E3_561_002: "Πωλήσεις αγαθών και υπηρεσιών Χονδρικές βάσει άρθρου 39α παρ 5 του Κώδικα Φ.Π.Α. (Ν.2859/2000)",
            IncomeClassification.E3_561_003: "Πωλήσεις αγαθών και υπηρεσιών Λιανικές - Ιδιωτική Πελατεία",
            IncomeClassification.E3_561_004: "Πωλήσεις αγαθών και υπηρεσιών Λιανικές βάσει άρθρου 39α παρ 5 του Κώδικα Φ.Π.Α. (Ν.2859/2000)",
            IncomeClassification.E3_561_005: "Πωλήσεις αγαθών και υπηρεσιών Εξωτερικού Ενδοκοινοτικές",
            IncomeClassification.E3_561_006: "Πωλήσεις αγαθών και υπηρεσιών Εξωτερικού Τρίτες Χώρες",
            IncomeClassification.E3_561_007: "Πωλήσεις αγαθών και υπηρεσιών Λοιπά",
            IncomeClassification.E3_562: "Λοιπά συνήθη έσοδα",
            IncomeClassification.E3_563: "Πιστωτικοί τόκοι και συναφή έσοδα",
            IncomeClassification.E3_564: "Πιστωτικές συναλλαγματικές διαφορές",
            IncomeClassification.E3_565: "Έσοδα συμμετοχών",
            IncomeClassification.E3_566: "Κέρδη από διάθεση μη κυκλοφορούντων περιουσιακών στοιχείων",
            IncomeClassification.E3_567: "Κέρδη από αναστροφή προβλέψεων και απομειώσεων",
            IncomeClassification.E3_568: "Κέρδη από επιμέτρηση στην εύλογη αξία",
            IncomeClassification.E3_570: "Ασυνήθη έσοδα και κέρδη",
            IncomeClassification.E3_595: "Έξοδα σε ιδιοπαραγωγή",
            IncomeClassification.E3_596: "Επιδοτήσεις - Επιχορηγήσεις",
            IncomeClassification.E3_597: "Επιδοτήσεις - Επιχορηγήσεις για επενδυτικούς σκοπούς - κάλυψη δαπανών",
            IncomeClassification.E3_880_001: "Πωλήσεις Παγίων Χονδρικές",
            IncomeClassification.E3_880_002: "Πωλήσεις Παγίων Λιανικές",
            IncomeClassification.E3_880_003: "Πωλήσεις Παγίων Εξωτερικού Ενδοκοινοτικές",
            IncomeClassification.E3_880_004: "Πωλήσεις Παγίων Εξωτερικού Τρίτες Χώρες",
            IncomeClassification.E3_881_001: "Πωλήσεις για λογαριασμό Τρίτων Χονδρικές",
            IncomeClassification.E3_881_002: "Πωλήσεις για λογαριασμό Τρίτων Λιανικές",
            IncomeClassification.E3_881_003: "Πωλήσεις για λογαριασμό Τρίτων Εξωτερικού Ενδοκοινοτικές",
            IncomeClassification.E3_881_004: "Πωλήσεις για λογαριασμό Τρίτων Εξωτερικού Τρίτες Χώρες",
            IncomeClassification.E3_598_001: "Πωλήσεις αγαθών που υπάγονται σε ΕΦΚ",
            IncomeClassification.E3_598_003: "Πωλήσεις για λογαριασμό αγροτών μέσω αγροτικού συνεταιρισμού κ.λ.π",
        }
        if self not in labels:
            raise ValueError(f"Undefined for: {self.name}")
        return labels[self]
