from enum import Enum


class InvoiceType(str, Enum):
    # Τιμολόγιο Πώλησης
    # ---------------------------------------------------------------
    TYPE_1_1 = "1.1"  # Τιμολόγιο Πώλησης
    TYPE_1_2 = "1.2"  # Τιμολόγιο Πώλησης / Ενδοκοινοτικές Παραδόσεις
    TYPE_1_3 = "1.3"  # Τιμολόγιο Πώλησης / Παραδόσεις Τρίτων Χωρών
    TYPE_1_4 = "1.4"  # Τιμολόγιο Πώλησης / Πώληση για Λογαριασμό Τρίτων
    TYPE_1_5 = "1.5"  # Τιμολόγιο Πώλησης / Εκκαθάριση Πωλήσεων Τρίτων - Αμοιβή από Πωλήσεις Τρίτων
    TYPE_1_6 = "1.6"  # Τιμολόγιο Πώλησης / Συμπληρωματικό Παραστατικό

    # Τιμολόγιο Παροχής Υπηρεσιών
    # ---------------------------------------------------------------
    TYPE_2_1 = "2.1"  # Τιμολόγιο Παροχής
    TYPE_2_2 = "2.2"  # Τιμολόγιο Παροχής / Ενδοκοινοτική Παροχή Υπηρεσιών
    TYPE_2_3 = "2.3"  # Τιμολόγιο Παροχής / Παροχή Υπηρεσιών σε λήπτη Τρίτης Χώρας
    TYPE_2_4 = "2.4"  # Τιμολόγιο Παροχής / Συμπληρωματικό Παραστατικό

    # Τίτλος Κτήσης
    # ---------------------------------------------------------------
    TYPE_3_1 = "3.1"  # Τίτλος Κτήσης (μή υπόχρεος Εκδότης)
    TYPE_3_2 = "3.2"  # Τίτλος Κτήσης (άρνηση έκδοσης από υπόχρεο Εκδότη)

    # Πιστωτικό Τιμολόγιο
    # ---------------------------------------------------------------
    TYPE_5_1 = "5.1"  # Πιστωτικό Τιμολόγιο / Συσχετιζόμενο
    TYPE_5_2 = "5.2"  # Πιστωτικό Τιμολόγιο / Μη Συσχετιζόμενο

    # Στοιχείο Αυτοπαράδοσης - Ιδιοχρησιμοποίησης
    # ---------------------------------------------------------------
    TYPE_6_1 = "6.1"  # Στοιχείο Αυτοπαράδοσης
    TYPE_6_2 = "6.2"  # Στοιχείο Ιδιοχρησιμοποίησης

    # Συμβόλαιο - Έσοδο
    # ---------------------------------------------------------------
    TYPE_7_1 = "7.1"  # Συμβόλαιο - Έσοδο

    # Ειδικό Στοιχείο (Έσοδο) – Απόδειξη Είσπραξης
    # ---------------------------------------------------------------
    TYPE_8_1 = "8.1"  # Ενοίκια - Έσοδο
    TYPE_8_2 = "8.2"  # Τέλος ανθεκτικότητας κλιματικής κρίσης
    TYPE_8_4 = "8.4"  # Απόδειξη Είσπραξης POS
    TYPE_8_5 = "8.5"  # Απόδειξη Επιστροφής POS

    # Δελτίο Παραγγελίας
    # ---------------------------------------------------------------
    TYPE_8_6 = "8.6"  # Δελτίο Παραγγελίας Εστίασης

    # Παραστατικό Διακίνησης
    # ---------------------------------------------------------------
    TYPE_9_3 = "9.3"  # Παραστατικό Διακίνησης Μη Συσχετιζόμενο

    # Παραστατικά Λιανικής
    # ---------------------------------------------------------------
    TYPE_11_1 = "11.1"  # ΑΛΠ
    TYPE_11_2 = "11.2"  # ΑΠΥ
    TYPE_11_3 = "11.3"  # Απλοποιημένο Τιμολόγιο
    TYPE_11_4 = "11.4"  # Πιστωτικό Στοιχ. Λιανικής
    TYPE_11_5 = "11.5"  # Απόδειξη Λιανικής Πώλησης για Λογ/σμό Τρίτων

    # Λήψη Παραστατικών Λιανικής
    # ---------------------------------------------------------------
    TYPE_13_1 = "13.1"  # Έξοδα - Αγορές Λιανικών Συναλλαγών ημεδαπής / αλλοδαπής
    TYPE_13_2 = "13.2"  # Παροχή Λιανικών Συναλλαγών ημεδαπής / αλλοδαπής
    TYPE_13_3 = "13.3"  # Κοινόχρηστα
    TYPE_13_4 = "13.4"  # Συνδρομές
    TYPE_13_30 = (
        "13.30"  # Παραστατικά Οντότητας ως Αναγράφονται από την ίδια (Δυναμικό)
    )
    TYPE_13_31 = "13.31"  # Πιστωτικό Στοιχ. Λιανικής ημεδαπής / αλλοδαπής

    # Παραστ. Εξαιρ. Οντοτήτων ημεδαπής / αλλοδαπής
    # ---------------------------------------------------------------
    TYPE_14_1 = "14.1"  # Τιμολόγιο / Ενδοκοινοτικές Αποκτήσεις
    TYPE_14_2 = "14.2"  # Τιμολόγιο / Αποκτήσεις Τρίτων Χωρών
    TYPE_14_3 = "14.3"  # Τιμολόγιο / Ενδοκοινοτική Λήψη Υπηρεσιών
    TYPE_14_4 = "14.4"  # Τιμολόγιο / Λήψη Υπηρεσιών Τρίτων Χωρών
    TYPE_14_5 = "14.5"  # ΕΦΚΑ και λοιποί Ασφαλιστικοί Οργανισμοί
    TYPE_14_30 = (
        "14.30"  # Παραστατικά Οντότητας ως Αναγράφονται από την ίδια (Δυναμικό)
    )
    TYPE_14_31 = "14.31"  # Πιστωτικό ημεδαπής / αλλοδαπής

    # Συμβόλαιο - Έξοδο
    # ---------------------------------------------------------------
    TYPE_15_1 = "15.1"  # Συμβόλαιο - Έξοδο

    # Ειδικό Στοιχείο (Έξοδο) – Απόδειξη Πληρωμής
    # ---------------------------------------------------------------
    TYPE_16_1 = "16.1"  # Ενοίκιο Έξοδο

    # Εγγραφές Τακτοποίησης Εσόδων - Εξόδων
    # Εγγραφές Οντότητας
    # ---------------------------------------------------------------
    TYPE_17_1 = "17.1"  # Μισθοδοσία
    TYPE_17_2 = "17.2"  # Αποσβέσεις
    TYPE_17_3 = "17.3"  # Λοιπές Εγγραφές Τακτοποίησης Εσόδων - Λογιστική Βάση
    TYPE_17_4 = "17.4"  # Λοιπές Εγγραφές Τακτοποίησης Εσόδων - Φορολογική Βάση
    TYPE_17_5 = "17.5"  # Λοιπές Εγγραφές Τακτοποίησης Εξόδων - Λογιστική Βάση
    TYPE_17_6 = "17.6"  # Λοιπές Εγγραφές Τακτοποίησης Εξόδων - Φορολογική Βάση

    @property
    def is_retail(self) -> bool:
        return self in {
            InvoiceType.TYPE_11_1,
            InvoiceType.TYPE_11_2,
            InvoiceType.TYPE_11_3,
            InvoiceType.TYPE_11_4,
            InvoiceType.TYPE_11_5,
        }

    @property
    def has_counterpart(self) -> bool:
        return self in {
            InvoiceType.TYPE_11_1,
            InvoiceType.TYPE_11_2,
            InvoiceType.TYPE_11_3,
            InvoiceType.TYPE_11_4,
            InvoiceType.TYPE_11_5,
            InvoiceType.TYPE_13_1,
            InvoiceType.TYPE_13_2,
            InvoiceType.TYPE_13_3,
            InvoiceType.TYPE_13_4,
            InvoiceType.TYPE_13_30,
            InvoiceType.TYPE_13_31,
        }

    @property
    def supports_fuel_invoice(self) -> bool:
        return self in {
            InvoiceType.TYPE_1_1,
            InvoiceType.TYPE_1_2,
            InvoiceType.TYPE_1_3,
            InvoiceType.TYPE_1_4,
            InvoiceType.TYPE_1_5,
            InvoiceType.TYPE_1_6,
            InvoiceType.TYPE_3_1,
            InvoiceType.TYPE_3_2,
            InvoiceType.TYPE_5_1,
            InvoiceType.TYPE_5_2,
            InvoiceType.TYPE_6_1,
            InvoiceType.TYPE_11_1,
            InvoiceType.TYPE_11_3,
            InvoiceType.TYPE_11_4,
            InvoiceType.TYPE_11_5,
        }

    @property
    def supports_delivery_note(self) -> bool:
        return self in {
            InvoiceType.TYPE_1_1,
            InvoiceType.TYPE_1_2,
            InvoiceType.TYPE_1_3,
            InvoiceType.TYPE_1_6,
            InvoiceType.TYPE_5_1,
            InvoiceType.TYPE_5_2,
            InvoiceType.TYPE_11_1,
        }

    @property
    def supports_self_pricing(self) -> bool:
        return self in {
            InvoiceType.TYPE_1_1,
            InvoiceType.TYPE_1_4,
            InvoiceType.TYPE_1_5,
            InvoiceType.TYPE_1_6,
            InvoiceType.TYPE_2_1,
            InvoiceType.TYPE_2_4,
            InvoiceType.TYPE_5_1,
            InvoiceType.TYPE_5_2,
        }

    @property
    def supports_tax_free(self) -> bool:
        return self in {
            InvoiceType.TYPE_11_1,
            InvoiceType.TYPE_11_4,
            InvoiceType.TYPE_11_5,
        }
